[
    {
        "title": "Oppenheimer",
        "year": 2023,
        "rating": "R",
        "duration": "3h",
        "score": 8.6,
        "description": "'Oppenheimer' is an epic biographical drama film about the story of American scientist J. Robert Oppenheimer and his role in the development of the atomic bomb. In World War II, Lt. Gen. Leslie Groves Jr. appoints physicist J. Robert Oppenheimer to lead the top-secret Manhattan Project. Oppenheimer and his team of scientists spend years into developing and designing the atomic bomb. Their efforts culminated on July 16, 1945, when they witness the first nuclear explosion ever, which forever altered the course of history. Christopher Nolan directed Oppenheimer, and stars Cillian Murphy, Emily Blunt, Robert Downey Jr. and Matt Damon."
    },
    {
        "title": "Elemental",
        "year": 2023,
        "rating": "PG",
        "duration": "1h 41m",
        "score": 7.0,
        "description": "'Elemental' is an animated adventure comedy that follows Ember and Wade in a city where fire, water, land, and air residents live together. In a city where fire, water, land, and air residents live together. Ember is a fiery young woman and Wafe is a go-with-the-flow guy; both discover something elemental: how much they actually have in common. The director of Elemental is Peter Sohn, and the film stars Leah Lewis, Mamoudou Athie and Ronnie Del Carmen."
    },
    {
        "title": "Top Gun: Maverick",
        "year": 2022,
        "rating": "PG-13",
        "duration": "2h 10m",
        "score": 8.3,
        "description": "The action drama 'Top Gun: Maverick' is about Pete 'Maverick' Mitchell, a top naval aviator who served in the Navy for over three decades and is now a test pilot. He is determined to keep pushing the limits of flying and avoid promotions that would take him away from the cockpit. Maverick is currently training a group of graduates for a unique mission but must also confront his past and fears. Ultimately, the mission will require those who choose to fly it to make the ultimate sacrifice. Joseph Kosinski directed Top Gun: Maverick, which stars Tom Cruise, Jennifer Connelly, and Miles Teller."
    },
    {
        "title": "Barbie",
        "year": 2023,
        "rating": "PG-13",
        "duration": "1h 54m",
        "score": 7.2,
        "description": "'Barbie' is an adventure comedy about Barbie's journey into the real world to understand herself and discover her true purpose. Barbie and Ken are having the time of their lives in the colorful and seemingly perfect world of Barbie Land. However, when they get to go to the real world, they soon discover the joys and perils of living among humans. Greta Gerwig directed Barbie, starring Margot Robbie, Ryan Gosling and Issa Rae."
    },
    {
        "title": "The Menu",
        "year": 2022,
        "rating": "R",
        "duration": "1h 47m",
        "score": 7.2,
        "description": "'The Menu' is a comedy thriller about a young couple traveling to a remote island to eat at an exclusive restaurant where the chef has prepared a lavish menu with shocking surprises. They anticipate a remarkable dining experience. However, unknown to the guests, Chef Julian, known for pushing culinary boundaries, is set to reveal his most audacious creation yet. The question arises: is the sophisticated clientele prepared for Julian's radical innovation? The director of 'The Menu' is Mark Mylod, and the film stars Ralph Fiennes, Anya Taylor-Joy and Nicholas Hoult."
    },
    {
        "title": "M3GAN",
        "year": 2022,
        "rating": "PG-13",
        "duration": "1h 42m",
        "score": 6.4,
        "description": "The horror/sci-fi movie 'M3GAN' deals with Gemma, a skilled roboticist who designs a life-like doll named M3GAN that can play, teach, and protect children. She gifts a prototype to her eight-year-old niece. The doll begins to take on a life of its own, resulting in unforeseen consequences. Gerard Johnstone directed M3GAN, which stars Allison Williams, Violet McGraw and Ronny Chieng."
    },
    {
        "title": "Glass Onion",
        "year": 2022,
        "rating": "PG-13",
        "duration": "2h 19m",
        "score": 7.1,
        "description": "In the comedic film 'Glass Onion', five long-time friends get invited to the Greek island home of billionaire Miles Bron. All five know Bron from way back and owe him their current wealth, fame, and careers. The main event is a murder-weekend game with Bron to be the victim. In reality, they all have reasons to kill him. Also invited is Benoit Blanc, the world's greatest detective. Rian Johnson directed Glass Onion and it stars Daniel Craig, Edward Norton and Kate Hudson."
    },
    {
        "title": "The Super Mario Bros. Movie",
        "year": 2023,
        "rating": "PG",
        "duration": "1h 32m",
        "score": 7.1,
        "description": "'The Super Mario Bros. Movie': While working underground to fix a water main, Brooklyn plumbers and brothers Mario and Luigi are transported through a mysterious pipe to a magical new world. But when the siblings are separated, an epic adventure begins to save a captured princess. The Super Mario Bros. Movie is an animated adventure comedy directed by Aaron Horvath, Michael Jelenic and Pierre Leduc. It's voiced by the actors Chris Pratt, Anya Taylor-Joy and Charlie Day."
    },
    {
        "title": "A Haunting in Venice",
        "year": 2023,
        "rating": "PG-13",
        "duration": "1h 43m",
        "score": 6.8,
        "description": "In 'A Haunting in Venice,' a post-WWII crime drama set in Venice, a retired detective attends a seance. Following a guest's murder, he's compelled to solve the mystery. The film's director is Kenneth Branagh, and stars Kenneth Branagh, Michelle Yeoh and Jamie Dornan."
    },
    {
        "title": "Blue Beetle",
        "year": 2023,
        "rating": "PG-13",
        "duration": "2h 7m",
        "score": 6.7,
        "description": "In the action-adventure film 'Blue Beetle', Jaime Reyes suddenly finds himself possessing an ancient relic of alien biotechnology called the Scarab. When the Scarab chooses Jaime to be its symbiotic host, he's bestowed with an incredible suit of armor capable of extraordinary and unpredictable powers, forever changing his destiny as he becomes the superhero Blue Beetle. The film stars Xolo Maridueña, Bruna Marquezine and Becky G, and Angel Manuel Soto is the director."
    },
    {
        "title": "Expend4bles",
        "year": 2023,
        "rating": "R",
        "duration": "1h 43m",
        "score": 5.0,
        "description": "'Expend4bles' is an action movie featuring an elite team of mercenaries known as 'The Expendables.' They are the world's last resort for missions deemed too perilous for others. With a formidable arsenal and unmatched combat skills, they tackle high-stakes assignments, displaying their courage and unity. Directed by Scott Waugh, Expend4bles is a thrilling ride, starring Jason Statham, 50 Cent, and Megan Fox."
    },
    {
        "title": "Asteroid City",
        "year": 2023,
        "rating": "PG-13",
        "duration": "1h 45m",
        "score": 6.6,
        "description": "Chronicling the journey of a writer's renowned fictional tale, 'Asteroid City' unveils the transformation of a mourning father. He takes his technology-fixated family to the quaint Asteroid City for a junior stargazing competition. But there, his perspective on life is irrevocably changed. Wes Anderson directed the comedic drama Asteroid City, starring Jason Schwartzman, Scarlett Johansson, and Tom Hanks."
    }
]